###################################################################

# Created by write_sdc on Mon Feb  7 20:44:23 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[31]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[30]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[29]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[28]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[27]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[26]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[25]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[24]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[23]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[22]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[21]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[20]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[19]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[18]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[17]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[16]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[15]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[14]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[13]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[12]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[11]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[10]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[9]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[8]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[7]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[6]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[5]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[4]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[3]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[2]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[1]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_instruction_memory[0]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[31]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[30]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[29]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[28]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[27]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[26]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[25]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[24]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[23]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[22]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[21]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[20]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[19]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[18]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[17]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[16]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[15]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[14]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[13]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[12]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[11]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[10]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[9]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[8]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[7]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[6]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[5]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[4]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[3]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[2]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[1]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_add_data_memory[0]}]
set_load -pin_load 3.40189 [get_ports RISC_V_MemRead]
set_load -pin_load 3.40189 [get_ports RISC_V_MemWrite]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[31]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[30]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[29]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[28]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[27]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[26]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[25]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[24]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[23]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[22]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[21]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[20]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[19]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[18]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[17]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[16]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[15]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[14]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[13]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[12]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[11]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[10]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[9]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[8]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[7]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[6]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[5]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[4]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[3]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[2]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[1]}]
set_load -pin_load 3.40189 [get_ports {RISC_V_DATA_data_memory[0]}]
create_clock [get_ports RISC_V_clk]  -name MY_CLK  -period 3 -waveform {0 1.5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RISC_V_rst_n]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_instruction[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_ReadData[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_instruction_memory[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_add_data_memory[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RISC_V_MemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RISC_V_MemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISC_V_DATA_data_memory[0]}]
